Show / Hide Table of Contents
Class StagedCheckSectionExtreme
Standard check section extreme
Inheritance
System.Object
CheckSectionExtreme
StagedCheckSectionExtreme
Inherited Members
 CheckSectionExtreme.Fundamental
 CheckSectionExtreme.Accidental
 CheckSectionExtreme.Characteristic
 CheckSectionExtreme.QuasiPermanent
 CheckSectionExtreme.Frequent
 CheckSectionExtreme.Fatigue
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public class StagedCheckSectionExtreme : CheckSectionExtreme
Constructors
Improve this Doc   View Source
StagedCheckSectionExtreme()
Constructor
Declaration
public StagedCheckSectionExtreme()
Properties
Improve this Doc   View Source
Time
Time
Declaration
public double Time { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source